rails1/store/app/controllers/departamentos_controller.rb

SELECT "departamentos".* FROM "departamentos"
---
  def index
    @departamentos = Departamento.all

INSERT INTO "departamentos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Moda"], ["created_at", "2023-05-16 16:58:32.186478"], ["updated_at", "2023-05-16 16:58:32.186478"]]
---
  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save

DELETE FROM "departamentos" WHERE "departamentos"."id" = ?  [["id", 1]]
---
  def destroy
    @departamento.destroy

SELECT "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_departamento
      @departamento = Departamento.find(params[:id])