rails1/store/app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order :nome
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        produto_params = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)

        @produto = Produto.new produto_params
        @departamentos = Departamento.all
        if @produto.save
---
SELECT "departamentos".* FROM "departamentos"
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "chinelo"], ["descricao", ""], ["preco", 1.0], ["quantidade", 1], ["created_at", "2023-05-16 17:22:32.450809"], ["updated_at", "2023-05-16 17:22:32.450809"], ["departamento_id", 1]]

    def destroy
        id = params.require(:id)
        Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 16]]

    def busca
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like 'ca')

    def new
        @produto = Produto.new
        @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

    def edit
        id = params[:id]
        @produto = Produto.find(id)
        @departamentos = Departamento.all
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
SELECT "departamentos".* FROM "departamentos"

    def update
        id = params[:id]
        @produto = Produto.find(id)
        novos_params = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)
        if @produto.update novos_params
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
UPDATE "produtos" SET "descricao" = ?, "preco" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "grande"], ["preco", 18.0], ["updated_at", "2023-05-16 18:06:15.272909"], ["id", 37]]