app/controllers/departamentos_controller.rb

  def index
    @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

  def show
    @produtos_por_departamento = Produto.where("departamento_id = ?", params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE (departamento_id = '1')

  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save
---
INSERT INTO "departamentos" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Calçados"], ["created_at", "2023-05-17 21:00:53.955163"], ["updated_at", "2023-05-17 21:00:53.955163"]]

  def update
    respond_to do |format|
      if @departamento.update(departamento_params)
---
UPDATE "departamentos" SET "nome" = $1, "updated_at" = $2 WHERE "departamentos"."id" = $3  [["nome", "MyString2"], ["updated_at", "2023-05-18 11:29:36.674829"], ["id", 980190962]]

  def destroy
    @departamento.destroy
---
DELETE FROM "departamentos" WHERE "departamentos"."id" = $1  [["id", 980190962]]

    def set_departamento
      @departamento = Departamento.find(params[:id])
---
SELECT "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]