app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order :nome
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT $1  [["LIMIT", 1]]

    def new
        @produto = Produto.new
        @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"